// 1. Опишіть своїми словами, що таке метод об'єкту?
//Значенням властивостей обʼєкта може бути будь-який тип данних: рядки, цифри, boolean і також функції. 
//Функція всередині обʼєкта буде методом. Функції всередині обʼєктів використовуються для того, щоб виконувати якісь дії зі значенням властивостей цих обʼєктів. 
//Як простий приклад можна уявити: у нас в обʼєкті є два значення: стара і нова ціна. І ми хочемо дізнатися їхню різницю. Для цього ми сторимо функцію, яка нам це порахує. Саме ця функція і буде методом обʼєкта.

// 2. Який тип даних може мати значення властивості об'єкта?
//Значенням властивостей обʼєкта може бути будь-який тип данних: рядки, цифри, boolean і також функції. 

// 3. Об'єкт це посилальний тип даних. Що означає це поняття?
//Наприклад: ми написали змінну let test = {name: Ivan, age: 20} в якій є обʼєкт з якимось значеннями. Якщо ми створюємо ще одну змінну і хочемо присвоїти їй попередній обʼєкт, то ми зможемо присвоїти лише посилання на цей обʼєкт (а не сам обʼєкт). Тобто змінна зберігає лише посилання на цей обʼєкт. І якщо ми змінимо значення обʼєкта в новій змінній - то це значенням обʼєкта зміниться і в першій змінній let test. Тому що у нас зберігається лише посилання на один обʼєкт, а не створюється два різних обʼєкти.





function createNewUser() {
  this.firstName = prompt("Напишіть Ваше імʼя")
  this.lastName = prompt("Напишіть Ваше прізвище")
  this.getLogin = function () {
    let lowerCase = (this.firstName[0] + this.lastName).toLowerCase()
    console.log(lowerCase);
    return lowerCase;
  }
}

let newUser = new createNewUser();
alert(`Ваш логін: ${newUser.getLogin()}`);




































