// 1. Описати своїми словами навіщо потрібні функції у програмуванні.

// Функції виконують дію. Досить часто буває, що потрібно виконати однокову дію, декілька разів підряд в різних місцях сайту. Саме в цьому нам зможуть допомоги функції. Тобто нам не потрібно в новому місці заново писати той же самий код. Ми зможемо зробити цю дію за допомогою функції, яку ми написали раніше. Тільки її для цього потрібно викликати. 
//function showOptions () {
//console.log ("Hello") }
//showOptions()
// Функція починається зі слова: function. Далі ми пишемо назву цієї функції: showOptions. Далі за необхідності пишемо її параметри/аргументи в дужках: (). І результат, який потрібно зробити {}. І потім, ми пишемо НАЗВУ самої функції ( showOptions() ). І таким чином ми можемо її викликати у будь-якому місці нашого коду і скільки завгодно разів.

// 2. Описати своїми словами, навіщо у функцію передавати аргумент.

// Аргументи потрібно передавати в функцію, для того щоб отримати в функцію певні значення. Аргументи можуть бути: числа, текст, сама функція може бути параметром функції і т.д. Ми можемо передавати в функцію декілька аргументів, які будуть записані через кому. При виклику функції з декількома аргументами, відбувається копіювання значень і передача їх по позиціям, тобто перше значення передається першому аргументу, друге значення передається другому аргументу.

// 3. Що таке оператор return та як він працює всередині функції?

// В якості результату, функція може повернути назад значення в код, який викликав цю функцію. Наприклад, функція, яка сумую декілька значень:
// function sum(a, b) {
// return a + b;}
// let res = sum(1, 1);
// console.log(res); // 2
// В даному випадку функція зупиняється відразу після виконання return a + b; і в код, який викликав цю функцію, повертається значення. 


let num1 = +prompt("Введіть перше число");
let num2 = +prompt("Введіть друге число");
let operation = prompt("Введіть математичну операцію + - * /");
let res;


while (!num1 || !num2 || !operation) {
   if (!num1) {
      num1 = prompt("Напишіть перше число");
   }
   if (!num2) {
      num2 = prompt("Напишіть друге число");
   }
   if (!operation) {
      operation = prompt("Напишіть математичну операцію + - * /");
   }
}

while (isNaN(num1) || isNaN(num2)) {
   if (isNaN(num1)) {
      num1 = prompt("Напишіть коректно перше число", num1);
   }
   if (isNaN(num2)) {
      num2 = prompt("Напишіть коректно друге число", num2);
   }
}

while (operation !== '+' && operation !== '-' && operation !== '*' && operation !== '/') {
   operation = prompt("Напишіть коректно математичну операцію + - * /", operation);
}


function calcsumm() {
   if (operation === '+') {
      res = num1 + num2;
      console.log(res);
   }

   else if (operation === '-') {
      res = num1 - num2;
      console.log(res);
   }

   else if (operation === '*') {
      res = num1 * num2;
      console.log(res);
   }

   else if (operation === '/') {
      res = num1 / num2;
      console.log(res);
   }
}
calcsumm();

